# Lection

In [1]:
import pandas as pd

In [10]:
df = pd.read_csv('lesson_1_data.csv', encoding = 'windows-1251', sep=';')

In [17]:
df.shape

(292, 8)

In [19]:
df.dtypes

Номер                  int64
Дата создания         object
Дата оплаты           object
Title                 object
Статус                object
Заработано           float64
Город                 object
Платежная система     object
dtype: object

In [20]:
df.describe()

              Номер    Заработано
count  2.920000e+02    292.000000
mean   1.063745e+06   3397.615034
std    4.438688e+02   5771.572829
min    1.062823e+06      0.000000
25%    1.063608e+06      0.000000
50%    1.063698e+06   2935.440000
75%    1.063807e+06   2935.440000
max    1.064796e+06  42750.000000

In [21]:
df.columns

Index(['Номер', 'Дата создания', 'Дата оплаты', 'Title', 'Статус',
       'Заработано', 'Город', 'Платежная система'],
      dtype='object')

In [23]:
df = df.rename(columns = {'Номер' : 'number', 
                     'Дата создания' : 'create_date', 
                     'Дата оплаты' : 'payment_date', 
                     'Title' : 'title', 
                     'Статус' : 'status',
                     'Заработано' : 'money', 
                     'Город' : 'city', 
                     'Платежная система' : 'payment_system'})

In [25]:
df[['title', 'status']]

                                                 title    status
0                              Курс обучения «Эксперт»  Завершен
1                              Курс обучения «Эксперт»  Завершен
2                           Курс обучения «Специалист»   Отменен
3                          Курс обучения «Консультант»   Отменен
4                              Курс обучения «Эксперт»   Отменен
..                                                 ...       ...
287  Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...  Завершен
288                        Курс обучения «Консультант»   Отменен
289                        Курс обучения «Консультант»  Завершен
290  Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...  Завершен
291  Курс от Школы Диетологов. Повышение квалификац...  Завершен

[292 rows x 2 columns]

In [29]:
all_money = round(df.money.sum(), 2)

In [30]:
all_money

992103.59

Найти сумму денег по каждому из курсов, проранжировать все эти курсы по заработанным деньгам и посмотреть разбивку по городам

In [38]:
df.groupby('title', as_index = False) \
    .agg({'money':sum}) \
    .sort_values('money', ascending = False)

                                               title      money
5  Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...  366947.20
0                        Курс обучения «Консультант»  208163.49
1                         Курс обучения «Специалист»  160862.64
2                            Курс обучения «Эксперт»  148992.80
4  Курс от Школы Диетологов. Повышение квалификац...   88384.92
3                   Курс от Школы Диетологов. Бизнес   18752.54

In [41]:
money_by_city = df.groupby(['title', 'city'], as_index = False) \
    .agg({'money':sum}) \
    .sort_values('money', ascending = False)

In [42]:
money_by_city.to_csv('money_by_city.csv', index = False)

In [58]:
money_by_title =  df \
    .query("status == 'Завершен' ") \
    .groupby('title', as_index = False) \
    .agg({'money':sum, 'number':'count'}) \
    .sort_values('money', ascending = False) \
    .rename(columns = {'number' : 'success_orders'})

In [59]:
# проверка данных
df.title.unique()

array(['Курс обучения «Эксперт»', 'Курс обучения «Специалист»',
       'Курс обучения «Консультант»', 'Курс от Школы Диетологов. Бизнес',
       'Курс от Школы Диетологов. Повышение квалификации. ',
       'Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автосписанием'],
      dtype=object)

In [61]:
money_by_title.money.sum()

992103.5900000003

# Tasks

In [62]:
taxi = pd.read_csv('2_taxi_nyc.csv')

In [64]:
taxi.shape

(29101, 14)

In [67]:
taxi.dtypes

pickup_dt        object
pickup_month     object
borough          object
pickups           int64
hday             object
spd             float64
vsb             float64
temp            float64
dewp            float64
slp             float64
pcp 01          float64
pcp 06          float64
pcp 24          float64
sd              float64
dtype: object

In [68]:
taxi.rename(columns = {'pcp 01' : 'pcp_01',
                       'pcp 06' : 'pcp_06',
                       'pcp 24' : 'pcp_24'})

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

In [102]:
s = taxi.groupby('borough').agg({'pickups':'sum'}).sort_values('pickups', ascending = False)

In [104]:
min_pickups = s.idxmin()

In [105]:
min_pickups

pickups    EWR
dtype: object

In [113]:
taxi \
    .groupby(['borough', 'pickup_month'], as_index = False) \
    .agg({'pickups':'sum'}) \
    .sort_values('pickups', ascending = False)

          borough pickup_month  pickups
21      Manhattan          Jun  1995388
23      Manhattan          May  1888800
19      Manhattan          Feb  1718571
22      Manhattan          Mar  1661261
18      Manhattan          Apr  1648278
20      Manhattan          Jan  1455543
9        Brooklyn          Jun   482466
11       Brooklyn          May   476087
6        Brooklyn          Apr   378095
10       Brooklyn          Mar   346726
7        Brooklyn          Feb   328650
8        Brooklyn          Jan   309011
27         Queens          Jun   286311
29         Queens          May   275893
28         Queens          Mar   219561
24         Queens          Apr   216857
25         Queens          Feb   185695
26         Queens          Jan   159211
5           Bronx          May    53037
3           Bronx          Jun    49006
0           Bronx          Apr    34617
4           Bronx          Mar    32232
1           Bronx          Feb    28694
2           Bronx          Jan    22461
33  Staten Island          Jun     1673
35  Staten Island          May     1517
30  Staten Island          Apr     1068
34  Staten Island          Mar      975
31  Staten Island          Feb      903
32  Staten Island          Jan      821
15            EWR          Jun       29
17            EWR          May       27
16            EWR          Mar       14
13            EWR          Feb       14
14            EWR          Jan       11
12            EWR          Apr       10

In [119]:
pickups_by_mon_bor = taxi.reset_index(drop=True)

# Project

In [2]:
bookings = pd.read_csv('bookings.csv', sep = ';')

In [3]:
bookings.shape

(119390, 21)

In [10]:
bookings.dtypes.value_counts()

object     10
int64      10
float64     1
dtype: int64

In [12]:
bookings.columns

Index(['Hotel', 'Is Canceled', 'Lead Time', 'arrival full date',
       'Arrival Date Year', 'Arrival Date Month', 'Arrival Date Week Number',
       'Arrival Date Day of Month', 'Stays in Weekend nights',
       'Stays in week nights', 'stays total nights', 'Adults', 'Children',
       'Babies', 'Meal', 'Country', 'Reserved Room Type', 'Assigned room type',
       'customer type', 'Reservation Status', 'Reservation status_date'],
      dtype='object')

In [22]:
bookings.columns = bookings.columns.str.lower().str.replace(' ', '_')

In [24]:
bookings.head()

,hotel,is_canceled,lead_time,arrival_full_date,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,...,adults,children,babies,meal,country,reserved_room_type,assigned_room_type,customer_type,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,C,Transient,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03

Пользователи из каких стран совершили наибольшее число успешных бронирований? 
Бронирование считается успешным, если в дальнейшем оно не было отменено (переменная is_canceled). В качестве ответа выберите страны, входящие в топ-5.

In [39]:
bookings.query('is_canceled == 0') \
        .groupby('country', as_index = False) \
        .agg({'hotel':'count'}) \
        .sort_values('hotel', ascending = False) \
        .head()

    country  hotel
125     PRT  21071
57      GBR   9676
54      FRA   8481
50      ESP   6391
42      DEU   6069

На сколько ночей (stays_total_nights)  в среднем бронируют отели типа City Hotel? Resort Hotel? Запишите полученные значения в пропуски с точностью до 2 знаков после точки.

In [43]:
bookings.groupby('hotel', as_index = False) \
        .agg({'stays_total_nights':'mean'}).round(2)

          hotel  stays_total_nights
0    City Hotel                2.98
1  Resort Hotel                4.32

Иногда тип номера, полученного клиентом (assigned_room_type), отличается от изначально забронированного (reserved_room_type). Такое может произойти, например, по причине овербукинга.
Сколько подобных наблюдений встретилось в датасете?

In [53]:
bookings.query('assigned_room_type != reserved_room_type').shape[0]

14917

Теперь проанализируйте даты запланированного прибытия (arrival_date_year).
На какой месяц чаще всего оформляли бронь в 2016 году? Изменился ли самый популярный месяц в 2017 году?

In [65]:
bookings \
        .groupby('arrival_date_year') \
        .arrival_date_month \
        .describe()['top']

arrival_date_year
2015    September
2016      October
2017          May
Name: top, dtype: object

 Сгруппируйте данные по годам, а затем проверьте, на какой месяц (arrival_date_month) бронирования отеля типа City Hotel отменялись чаще всего в 2015? 2016? 2017?

In [76]:
bookings.query(" hotel == 'City Hotel' & is_canceled == 1 ") \
        .groupby('arrival_date_year') \
        .arrival_date_month.describe()['top']

arrival_date_year
2015    September
2016      October
2017          May
Name: top, dtype: object

Создайте колонку total_kids, объединив столбцы children и babies. Для отелей какого типа среднее значение переменной оказалось наибольшим?

In [82]:
bookings['total_kids'] = bookings.children + bookings.babies

In [87]:
bookings.groupby('hotel').agg({'total_kids':'mean'}).round(2)

              total_kids
hotel
City Hotel          0.10
Resort Hotel        0.14

Создайте переменную has_kids, которая принимает значение True, если клиент при бронировании указал хотя бы одного ребенка (total_kids), в противном случае – False. Далее проверьте, среди какой группы пользователей показатель оттока выше.

In [88]:
bookings['has_kids'] = [True if row > 0.0 else False for row in bookings['total_kids']]

In [105]:
bookings.groupby(['has_kids']).is_canceled.value_counts(normalize=True).round(4)

has_kids  is_canceled
False     0              0.6278
          1              0.3722
True      0              0.6508
          1              0.3492
Name: is_canceled, dtype: float64

In [111]:
no_kids_chrate = bookings.query('is_canceled == 1 & has_kids == False').shape[0] / bookings.query('has_kids == False').shape[0]

In [112]:
round(100*no_kids_chrate, 2)

37.22

In [ ]:
yes_kids_chrate = bookings.query('is_canceled == 1 & has_kids == False').shape[0] / bookings.query('has_kids == False').shape[0]